<a href="https://colab.research.google.com/github/BHARATH-D-095/Task-s-/blob/main/task_on_3MRVSTD.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import os
os.getcwd()

'C:\\Users\\bhara\\onedrive\\desktop'

In [ ]:
os.chdir('C:\\Users\\bhara\\onedrive\\desktop')

In [ ]:
df=pd.read_csv('supermarket.csv')

In [ ]:
df

           ProductCode              Date   Amount  Received Cash CashierName
0      LBVT18010004435  01-05-2018 12:36  1121.20        1121.20       MAYTE
1      LBVT18010004436  01-05-2018 12:37    18.50          20.00       MAYTE
2      LBVT18010004437  01-05-2018 12:38   160.00         200.00       MAYTE
3      LBVT18010004438  01-05-2018 12:47   397.50         397.50       MAYTE
4      LBVT18010004439  01-05-2018 12:48    22.00          50.00       MAYTE
...                ...               ...      ...            ...         ...
84876  LBVT18070002269  31-08-2018 17:03    16.32          16.32   JAQUELINE
84877  LBVT18070002270  31-08-2018 17:04    28.32          28.32   JAQUELINE
84878  LBVT18070002271  31-08-2018 17:06    21.36          50.00   JAQUELINE
84879  LBVT18070002272  31-08-2018 17:27    50.00          50.00   JAQUELINE
84880  LBVT18070002273  31-08-2018 17:36    30.14          50.00   JAQUELINE

[84881 rows x 5 columns]

In [ ]:
df.shape

(84881, 5)

In [ ]:
df.size

424405

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84881 entries, 0 to 84880
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ProductCode    84881 non-null  object
 1   Date           84881 non-null  object
 2   Amount         84881 non-null  float64
 3   Received Cash  84881 non-null  float64
 4   CashierName    84881 non-null  object
dtypes: float64(2), object(3)
memory usage: 3.2+ MB

In [ ]:
df.Amount.head(3)

0    1121.2
1      18.5
2     160.0
Name: Amount, dtype: float64

In [ ]:
mean=df['Amount'].mean()
median=df['Amount'].median()
mode=df['Amount'].mode()
range=df.Amount.max()-df.Amount.min()
range
varience=df['Amount'].var()
standard_deviation=df.Amount.std()

In [ ]:
maximum=df.Amount.max()

In [ ]:
minimum=df.Amount.min()

In [ ]:
             ########### for column 'amount'
print('mean:',mean)
print('median:',median)
print('mode:',mode)
print('range:',range)
print('varience:',varience)
print('standard_deviation:',standard_deviation)

mean: 189.78110872868814
median: 95.0
mode: 0    50.0
Name: Amount, dtype: float64
range: 15036.8
varience: 80674.52936872175
standard_deviation: 284.0326202546492

In [ ]:
df

           ProductCode              Date   Amount  Received Cash CashierName
0      LBVT18010004435  01-05-2018 12:36  1121.20        1121.20       MAYTE
1      LBVT18010004436  01-05-2018 12:37    18.50          20.00       MAYTE
2      LBVT18010004437  01-05-2018 12:38   160.00         200.00       MAYTE
3      LBVT18010004438  01-05-2018 12:47   397.50         397.50       MAYTE
4      LBVT18010004439  01-05-2018 12:48    22.00          50.00       MAYTE
...                ...               ...      ...            ...         ...
84876  LBVT18070002269  31-08-2018 17:03    16.32          16.32   JAQUELINE
84877  LBVT18070002270  31-08-2018 17:04    28.32          28.32   JAQUELINE
84878  LBVT18070002271  31-08-2018 17:06    21.36          50.00   JAQUELINE
84879  LBVT18070002272  31-08-2018 17:27    50.00          50.00   JAQUELINE
84880  LBVT18070002273  31-08-2018 17:36    30.14          50.00   JAQUELINE

[84881 rows x 5 columns]

In [ ]:
mean1=df['Received_Cash'].mean()
median1=df['Received_Cash'].median()
mode1=df['Received_Cash'].mode()
range1=df.Received_Cash.max()-df.Received_Cash.min()
range1
df.Received_Cash.max()
df.Received_Cash.min()
varience1=df.Received_Cash.var()
standard_deviation1=df.Received_Cash.std()

In [ ]:
                      ########### for column 'Received_cash'
print('mean:',mean1)
print('median:',median1)
print('mode:',mode1)
print('range:',range1)
print('varience:',varience1)
print('standard_deviation:',standard_deviation1)

mean: 185273189.80236167
median: 155.0
mode: 0    200.0
Name: Received_Cash, dtype: float64
range: 7500000000000.0
varience: 1.3314909444556508e+21
standard_deviation: 36489600497.3424

In [ ]:
df=df.rename(columns={'Received Cash':'Received_Cash'})
df

           ProductCode              Date   Amount  Received_Cash CashierName
0      LBVT18010004435  01-05-2018 12:36  1121.20        1121.20       MAYTE
1      LBVT18010004436  01-05-2018 12:37    18.50          20.00       MAYTE
2      LBVT18010004437  01-05-2018 12:38   160.00         200.00       MAYTE
3      LBVT18010004438  01-05-2018 12:47   397.50         397.50       MAYTE
4      LBVT18010004439  01-05-2018 12:48    22.00          50.00       MAYTE
...                ...               ...      ...            ...         ...
84876  LBVT18070002269  31-08-2018 17:03    16.32          16.32   JAQUELINE
84877  LBVT18070002270  31-08-2018 17:04    28.32          28.32   JAQUELINE
84878  LBVT18070002271  31-08-2018 17:06    21.36          50.00   JAQUELINE
84879  LBVT18070002272  31-08-2018 17:27    50.00          50.00   JAQUELINE
84880  LBVT18070002273  31-08-2018 17:36    30.14          50.00   JAQUELINE

[84881 rows x 5 columns]

In [ ]:
df.CashierName.unique() ### 21 casheiers are there

array(['MAYTE', 'GABY LUCIO', 'ALE HUERTA', 'FERNANDO C', 'MARICRUZ',
       'EDUARDO V', 'MONSE L.', 'SARAHY', 'JANET', 'JUAN MARTIN',
       'CLAUDIA', 'LINA', 'ALE DIAZ', 'MAGO', 'ELI C.', 'JAQUELINE',
       'JESUS PEREZ', 'ROSI MEJIA', 'MIRIAM LANDIN', 'MIRIAM', 'EDUARDO'],
      dtype=object)

In [ ]:
df1=df[df['CashierName']=='MAYTE']     ### calculating for only one cashier 'MAYTE'
df1

           ProductCode              Date   Amount  Received_Cash CashierName
0      LBVT18010004435  01-05-2018 12:36  1121.20        1121.20       MAYTE
1      LBVT18010004436  01-05-2018 12:37    18.50          20.00       MAYTE
2      LBVT18010004437  01-05-2018 12:38   160.00         200.00       MAYTE
3      LBVT18010004438  01-05-2018 12:47   397.50         397.50       MAYTE
4      LBVT18010004439  01-05-2018 12:48    22.00          50.00       MAYTE
...                ...               ...      ...            ...         ...
54832  LBVT18010013439  22-07-2018 15:39    49.90          50.00       MAYTE
54833  LBVT18010013440  22-07-2018 15:44   756.99         756.99       MAYTE
54834  LBVT18010013441  22-07-2018 15:45   261.60         261.60       MAYTE
54835  LBVT18010013442  22-07-2018 15:46    17.30          20.00       MAYTE
54836  LBVT18010013443  22-07-2018 15:46    20.00         100.00       MAYTE

[5565 rows x 5 columns]

In [ ]:
mean=df1['Amount'].mean()
median=df1['Amount'].median()
mode=df1['Amount'].mode()
range=df1.Amount.max()-df.Amount.min()
range
varience=df1['Amount'].var()
standard_deviation=df1.Amount.std()

In [ ]:
print('Cashier Name:',df1.CashierName.unique())
print('mean:',mean)
print('median:',median)
print('mode:',mode)
print('range:',range)
print('varience:',varience)
print('standard_deviation:',standard_deviation)

Cashier Name: ['MAYTE']
mean: 202.46861096136556
median: 106.0
mode: 0    100.0
Name: Amount, dtype: float64
range: 7235.629999999999
varience: 78579.89730754131
standard_deviation: 280.3210611201757

In [ ]:
len(df1)

5565

In [ ]:
print('Cashier Name:',df1.CashierName.unique())

Cashier Name: ['MAYTE']